In [2]:
import pandas as pd

In [2]:
tables = pd.read_html('./dataset/sample.html')
tables

[   Unnamed: 0  c0  c1  c2  c3
 0           0   0   1   4   7
 1           1   1   2   5   8
 2           2   2   3   6   9,
          name  year        developer  opensource
 0       NumPy  2006  Travis Oliphant        True
 1  matplotlib  2003   John D. Hunter        True
 2      pandas  2008    Wes Mckinneye        True]

In [3]:
# 테일블 갯수 확인

print(len(tables))

for i in range(len(tables)):
    print(tables[i]); print()
    
df = tables[1]
print(df)

2
   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9

         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [4]:
# name 컬럼을 익덱스로 설정

df.set_index('name', inplace = True)
df

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

In [5]:
# 'NumPy' 인덱스행의 정보만 출력

df.loc['NumPy', :]
df

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

In [6]:
# year 가 2006 이후인 자료만 검색

df.loc[df.year >= 2006, :]
df

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

In [3]:
# 데이터프레임 자료를 csv 파일로 저장

data = {'name': ['Jerry', 'Riah', 'Paul'] , 
       'algol' : ['a', 'b', 'c']}
df = pd.DataFrame(data)

In [7]:
df

    name algol
0  Jerry     a
1   Riah     b
2   Paul     c

In [9]:
df.to_csv('./dataset/to_csv_sa')       # dataset 파일에 to_csv_sa 파일 생성
                                       # 'df.to_OO' 이런 식으로

In [17]:
# 여러 개의  파일을 엑셀로 저장
# 판다스 DataFrame() 함수로 데이터프레임 변환. 변수 df1, df2에 저장  

data1 = {'name' : [ 'Jerry', 'Riah', 'Paul'],
         'algol' : [ "A", "A+", "B"],
         'basic' : [ "C", "B", "B+"],
          'c++' : [ "B+", "C", "C+"]}

data2 = {'c0':[1,2,3], 
         'c1':[4,5,6], 
         'c2':[7,8,9], 
         'c3':[10,11,12], 
         'c4':[13,14,15]}

In [18]:
df1 = pd.DataFrame(data1)       # 데이터프레임을 임의로 설정
df2 = pd.DataFrame(data2)

In [19]:
# df1의 'name' 컬럼을 인덱스로 설정

df1.set_index('name', inplace=True)
df1

      algol basic c++
name
Jerry     A     C  B+
Riah     A+     B   C
Paul      B    B+  C+

In [20]:
# df2의 'c0' 컬럼을 인덱스로 설정

df2.set_index('c0', inplace=True)
df2

    c1  c2  c3  c4
c0
1    4   7  10  13
2    5   8  11  14
3    6   9  12  15

In [ ]:
# 데이터프레임 하나를 엑셀에 넣기 위해서는
# df.to_excel("./dataset/two_excel.xlsx") 로 하면 된다.

In [21]:
# ExcelWriter를 사용하여 두 개의 파일을 하나의 엑셀 파일에 저장

writer = pd.ExcelWriter("./dataset/two_excel.xlsx")
df1.to_excel(writer, sheet_name='df1')        # 시트 하나에 한 데이터를 넣는다.
df2.to_excel(writer, sheet_name='df2')    
writer.save()